In [1]:
import pandas as pd

**Pandas Sereis**

In [3]:
ser = pd.Series([100,200,300,400],['tom','bob','nancy','dan'])
print(ser)

tom      100
bob      200
nancy    300
dan      400
dtype: int64

In [7]:
ser

tom      100
bob      200
nancy    300
dan      400
dtype: int64

In [8]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan'], dtype='object')

In [15]:
ser.loc['bob']

200

In [11]:
ser[[0,1,2]]

tom      100
bob      200
nancy    300
dtype: int64

In [14]:
ser.iloc[[1,2]]

bob      200
nancy    300
dtype: int64

In [16]:
'bob' in ser

True

In [20]:
ser +2

tom      102
bob      202
nancy    302
dan      402
dtype: int64

In [22]:
ser[['nancy','bob']]*5

nancy    1500
bob      1000
dtype: int64

**Pandas Dataframe**

In [2]:
d = {'one' : pd.Series([100, 200, 300], index =['apple','ball','clock']),
     'two' : pd.Series([400,500,600,700], index = ['apple','ball','cerill','dancy'])}

In [3]:
df=pd.DataFrame(d)

In [4]:
df.index

Index(['apple', 'ball', 'cerill', 'clock', 'dancy'], dtype='object')

In [5]:
df.columns

Index(['one', 'two'], dtype='object')

In [35]:
pd.DataFrame(d, index = ['orange','one','apple'])

         one  two
dancy    NaN  700
ball   200.0  500
apple  100.0  400

In [36]:
pd.DataFrame(d, index = ['dancy','ball','apple'], columns=['two','five'])

       two five
dancy  700  NaN
ball   500  NaN
apple  400  NaN

In [37]:
data = [{'alex':1,'joe':2},{'ema':5,'dora':10,'alice':20}]

In [50]:
d2 =pd.DataFrame(data)

In [51]:
d2.index

RangeIndex(start=0, stop=2, step=1)

In [55]:
d2.columns

Index(['alex', 'alice', 'dora', 'ema', 'joe'], dtype='object')

In [40]:
pd.DataFrame(data, index=['orange','red'])

        alex  alice  dora  ema  joe
orange   1.0    NaN   NaN  NaN  2.0
red      NaN   20.0  10.0  5.0  NaN

In [41]:
pd.DataFrame(data, index=['one','two'])

     alex  alice  dora  ema  joe
one   1.0    NaN   NaN  NaN  2.0
two   NaN   20.0  10.0  5.0  NaN

In [44]:
pd.DataFrame(data, index=['one','two'])

     alex  alice  dora  ema  joe
one   1.0    NaN   NaN  NaN  2.0
two   NaN   20.0  10.0  5.0  NaN

In [6]:
df['one']

apple     100.0
ball      200.0
cerill      NaN
clock     300.0
dancy       NaN
Name: one, dtype: float64

In [8]:
df['three'] = df['one']*2
df

          one    two  three
apple   100.0  400.0  200.0
ball    200.0  500.0  400.0
cerill    NaN  600.0    NaN
clock   300.0    NaN  600.0
dancy     NaN  700.0    NaN

In [10]:
df['four'] = df['one']
df

          one    two  three   four
apple   100.0  400.0  200.0  100.0
ball    200.0  500.0  400.0  200.0
cerill    NaN  600.0    NaN    NaN
clock   300.0    NaN  600.0  300.0
dancy     NaN  700.0    NaN    NaN

In [12]:
df['four'] = df['one'] > 150
df

          one    two  three   four
apple   100.0  400.0  200.0  False
ball    200.0  500.0  400.0   True
cerill    NaN  600.0    NaN  False
clock   300.0    NaN  600.0   True
dancy     NaN  700.0    NaN  False

In [15]:
three = df.pop('three')

In [16]:
three

apple     200.0
ball      400.0
cerill      NaN
clock     600.0
dancy       NaN
Name: three, dtype: float64

In [21]:
#del df['two']
df

          one   four
apple   100.0  False
ball    200.0   True
cerill    NaN  False
clock   300.0   True
dancy     NaN  False

In [24]:
df.insert(1, 'copy_of_one_1',df['one'])
df

          one  copy_of_one_1   four  copy_of_one
apple   100.0          100.0  False        100.0
ball    200.0          200.0   True        200.0
cerill    NaN            NaN  False          NaN
clock   300.0          300.0   True        300.0
dancy     NaN            NaN  False          NaN

In [25]:
df['one_upper_half'] = df['one'][:2]
df

          one  copy_of_one_1   four  copy_of_one  one_upper_half
apple   100.0          100.0  False        100.0           100.0
ball    200.0          200.0   True        200.0           200.0
cerill    NaN            NaN  False          NaN             NaN
clock   300.0          300.0   True        300.0             NaN
dancy     NaN            NaN  False          NaN             NaN